In [5]:
# %load ../local_connect.py
import sqlalchemy
engine = sqlalchemy.create_engine('mysql+mysqlconnector://tushar:@localhost', echo=True)
%load_ext sql
%sql mysql+mysqlconnector://tushar:@localhost
%config SqlMagic.autopandas=True

import pandas as pd
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 50)
pd.set_option('display.width', 1000)

Q1. Write a query to Display the records having 3 or more consicutive rows with more than 100 people each day

Table: test.stadium

id visit_date no_of_people

5  2017-07-05 145  

6  2017-07-06 1455

7  2017-07-07 199

8  2017-07-08 188

In [6]:
%%sql
select * from test.stadium

 * mysql+mysqlconnector://tushar:***@localhost
8 rows affected.

   id  visit_date  no_of_people
0   1  2017-07-01            10
1   2  2017-07-02           109
2   3  2017-07-03           150
3   4  2017-07-04            99
4   5  2017-07-05           145
5   6  2017-07-06          1455
6   7  2017-07-07           199
7   8  2017-07-08           188

In [15]:
%%sql
with info as(
select id, visit_date, no_of_people,
    id - row_number() over (order by id asc) diff
from test.stadium
where no_of_people>=100
)
select * from info
where diff in (select diff from info group by 1 having count(1)>3)

 * mysql+mysqlconnector://tushar:***@localhost
4 rows affected.

   id  visit_date  no_of_people  diff
0   5  2017-07-05           145     2
1   6  2017-07-06          1455     2
2   7  2017-07-07           199     2
3   8  2017-07-08           188     2

Q2. Write a sql query to find the 3rd highest salary employee in each department, in case there are less than 3 employees return
the employee with lowest salary.

Table: test.emp

    emp_id    emp_name    salary    dep_id    dep_name

In [16]:
%%sql
select * from test.emp

 * mysql+mysqlconnector://tushar:***@localhost
11 rows affected.

    emp_id emp_name  salary  manager_id  emp_age  dep_id   dep_name  gender
0        1    Ankit   14300           4       39     100  Analytics  Female
1        2    Mohit   14000           5       48     200         IT    Male
2        3    Vikas   12100           4       37     100  Analytics  Female
3        4    Rohit    7260           2       16     100  Analytics  Female
4        5    Mudit   15000           6       55     200         IT    Male
5        6     Agam   15600           2       14     200         IT    Male
6        7   Sanjay   12000           2       13     200         IT    Male
7        8   Ashish    7200           2       12     200         IT    Male
8        9   Mukesh    7000           6       51     300         HR    Male
9       10   Rakesh    8000           6       50     300         HR    Male
10      11    Akhil    4000           1       31     500        Ops    Male

In [30]:
%%sql
with info as(
select emp_id, emp_name, salary, dep_id, dep_name,
       rank() over(partition by dep_name order by salary) as rn,
       case when count(*) over(partition by dep_name) >= 3 then 'yes' else 'no' end as include
    from test.emp),
id_info as (
select case when include='yes' then 3 else 1 end as id
    from info
)

select emp_id, emp_name, salary, dep_id, dep_name from info where include='yes' and rn=3
union
select emp_id, emp_name, salary, dep_id, dep_name from info where include='no' and rn=1

 * mysql+mysqlconnector://tushar:***@localhost
4 rows affected.

   emp_id emp_name  salary  dep_id   dep_name
0       1    Ankit   14300     100  Analytics
1       2    Mohit   14000     200         IT
2       9   Mukesh    7000     300         HR
3      11    Akhil    4000     500        Ops

Q3. 

table: test.buy and test.sell

result

    buy_time    buy_qty    sell_qty
    -------------------------------
    10          10         10
    15          5          5
    15          15         NULL

In [66]:
%%sql
select * from test.Buy;

 * mysql+mysqlconnector://tushar:***@localhost
2 rows affected.

   Date  Time  Qty  per_share_price  total_value
0    15    10   10               10          100
1    15    14   20               10          200

In [67]:
%%sql
 select * from test.sell;

 * mysql+mysqlconnector://tushar:***@localhost
1 rows affected.

   Date  Time  Qty  per_share_price  total_value
0    15    15   15               20          300

Q4. find median salary of employees for each company

table: test.employee

In [31]:
%%sql
select * from test.employee

 * mysql+mysqlconnector://tushar:***@localhost
17 rows affected.

    emp_id company  salary
0        1       A    2341
1        2       A     341
2        3       A      15
3        4       A   15314
4        5       A     451
5        6       A     513
6        7       B      15
7        8       B      13
8        9       B    1154
9       10       B    1345
10      11       B    1221
11      12       B     234
12      13       C    2345
13      14       C    2645
14      15       C    2645
15      16       C    2652
16      17       C      65

In [44]:
%%sql
with info as(
select emp_id, company, salary,
row_number() over(partition by company order by salary) as rn
from test.employee),
info2 as(
select company, max(rn)/2 as start, max(rn)/2 + 1 as end
from info group by 1)

select emp_id, i1.company, salary from info i1
join info2 i2 on i1.company=i2.company
and i1.rn>=i2.start and i1.rn<=i2.end

 * mysql+mysqlconnector://tushar:***@localhost
5 rows affected.

   emp_id company  salary
0       5       A     451
1       6       A     513
2      12       B     234
3       9       B    1154
4      14       C    2645

Q5. PIVOT table data

table: test.players_location
    
    Bangalore    mumbai    Delhi
    ----------------------------
    Mayank       Mohit     Virat
    Rahul        Sachin    NULL

In [47]:
%%sql
select * from test.players_location

 * mysql+mysqlconnector://tushar:***@localhost
5 rows affected.

     name       city
0  Sachin     Mumbai
1   Virat      Delhi
2   Rahul  Bangalore
3   Rohit     Mumbai
4  Mayank  Bangalore

In [59]:
%%sql
with info as(
select *, row_number() over(partition by city) as player_groups
from test.players_location)
select player_groups,
max(case when city='Bangalore' then name end) as Bangalore,
max(case when city='Delhi' then name end) as Delhi,
max(case when city='Mumbai' then name end) as Mumbai
from info group by 1

 * mysql+mysqlconnector://tushar:***@localhost
2 rows affected.

   player_groups Bangalore  Delhi  Mumbai
0              1     Rahul  Virat  Sachin
1              2    Mayank   None   Rohit

In [61]:
%%sql
select
case when city='Bangalore' then name end as bangalore,
case when city='Delhi' then name end as delhi,
case when city='Mumbai' then name end as mumbai
from test.players_location

 * mysql+mysqlconnector://tushar:***@localhost
5 rows affected.

  bangalore  delhi  mumbai
0      None   None  Sachin
1      None  Virat    None
2     Rahul   None    None
3      None   None   Rohit
4    Mayank   None    None